{"format": "layers-model", "generatedBy": "keras v3.10.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer", "batch_input_shape": [null, 2560, 18]}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "TimeDistributed", "config": {"name": "td_e1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "td_e1", "inbound_nodes": [[["input_layer", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "td_e2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "td_e2", "inbound_nodes": [[["td_e1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "td_e3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "td_e3", "inbound_nodes": [[["td_e2", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling1d", "inbound_nodes": [[["td_e3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "d_c1", "trainable": true, "dtype": "float32", "units": 64, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "d_c1", "inbound_nodes": [[["global_average_pooling1d", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "td_p1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 64, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "td_p1", "inbound_nodes": [[["td_e3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "d_c2", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "d_c2", "inbound_nodes": [[["d_c1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "td_p2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "td_p2", "inbound_nodes": [[["td_p1", 0, 0, {}]]]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["d_c2", 0, 0], ["td_p2", 0, 0], ["td_e3", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "d_c1/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "d_c1/bias", "shape": [64], "dtype": "float32"}, {"name": "d_c2/kernel", "shape": [64, 4], "dtype": "float32"}, {"name": "d_c2/bias", "shape": [4], "dtype": "float32"}, {"name": "td_e1/dense/kernel", "shape": [18, 128], "dtype": "float32"}, {"name": "td_e1/dense/bias", "shape": [128], "dtype": "float32"}, {"name": "td_e2/dense_1/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "td_e2/dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "td_e3/dense_2/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "td_e3/dense_2/bias", "shape": [128], "dtype": "float32"}, {"name": "td_p1/dense_3/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "td_p1/dense_3/bias", "shape": [64], "dtype": "float32"}, {"name": "td_p2/dense_4/kernel", "shape": [64, 5], "dtype": "float32"}, {"name": "td_p2/dense_4/bias", "shape": [5], "dtype": "float32"}]}]}